<?php
session_start(); /* Початок сессії */
require_once('header.php'); /* Верхня частина сайту */
$newsData = $db->readAll('news');
?>
<p>
    Бакалаврська робота студента 545-а групи Ішкова Руслана Вікторовича.
</p>
<p>
    Робота присвячена розробці системи управління дропшипінгом з наданням API для дрібних магазинів.
</p>
<p>
    Метою роботи є розробка сайту з використанням HTML, CSS, JavaScript. Функціонал якого імітує роботу дропшипінгу
    з можливостям керування обліковими засобами, категоріями, товарами та наданням можливоті взаємодії через API.
</p>
<p>
    Джерелом даних є адміністратор який має мету розмістити товар на сайті, а також продавці які розміщують товар на
    своїх майданчиках та передають сформовані замовлення.
</p>
<p>
    Результатом роботи сайт який надає зручні можливості дропшопінга для продавців.
</p>

<table>
    <?php 
    $currentDate = date('Y-m-d'); // Отримуємо поточну дату у форматі 'YYYY-MM-DD'
    foreach ($newsData as $news): 
        // Перевіряємо, чи новина дійсна на сьогодні
        if ($news['start_date'] <= $currentDate && $news['end_date'] >= $currentDate): ?>
            <tr>
                <td width="20%"><!-- Редагування по натисканню на зображення -->
                    <img src="../images/news/<?php echo $news['uploadPath']; ?>">
                </td>
                <td width="20%"><?php echo $news['news_title']; ?></td>
                <td><?php echo $news['news_description']; ?></td>
            </tr>
        <?php endif; 
    endforeach; ?>
</table>


<?php require_once('../php/footer.php'); ?>