<?php
session_start(); /* Початок сессії */
require_once ('header.php'); /* Верхня частина сайту */
?>

<div class="main-block"><!-- Інформаційна сторінка, є головною сторінкою сайту -->
    <p>
        Курсова робота студента 535-а групи Ішкова Руслана Вікторовича.
    </p>
    <p>Розробити систему CMS керування, отриманий каталог повинен взаємодіяти з базою даних, мати можливість
        авторизації з різними правами. Розробити ролі з правами доступу “Адміністратор”, “Продавець”, “Користувач”.
    </p>
    <p>
        Адміністратор повинен мати можливість взаємодіяти з доступом інших користувачів(зміна), взаємодіяти з
        каталогами та їх вмістом(створення/редагування/видалення каталогів).
    </p>
    <p>
        Продавець повинен мати можливість з власними товарами(створення товару/зміна інформації про товар/видалення
        пропозиції).
    </p>
    <p>
        Користувач повинен мати можливість взаємодіяти з каталогами та фільтрами для пошуку товарів.
    </p>
</div>
<?php require_once ('../php/footer.php'); ?>