<?php
session_start(); /* Початок сессії */
require_once('header.php'); /* Верхня частина сайту */
?>
<p>
    Бакалаврська робота студента 545-а групи Ішкова Руслана Вікторовича.
</p>
<p>
    Робота присвячена розробці системи управління дропшипінгом з наданням API для дрібних магазинів.
</p>
<p>
    Метою роботи є розробка сайту з використанням HTML, CSS, JavaScript. Функціонал якого імітує роботу дропшипінгу
    з можливостям керування обліковими засобами, категоріями, товарами та наданням можливоті взаємодії через API.
</p>
<p>
    Джерелом даних є адміністратор який має мету розмістити товар на сайті, а також продавці які розміщують товар на
    своїх майданчиках та передають сформовані замовлення.
</p>
<p>
    Результатом роботи сайт який надає зручні можливості дропшопінга для продавців.
</p>
<?php require_once('../php/footer.php'); ?>